---
kind: type
id: T:Autodesk.Revit.DB.NumericRevisionSettings
source: html/3de46f00-fbf9-0c6b-b7fa-5d33052d0091.htm
---
# Autodesk.Revit.DB.NumericRevisionSettings

Contains settings that apply to Revisions with the Numeric RevisionNumberType.

## Syntax (C#)
```csharp
public class NumericRevisionSettings : IDisposable
```